-  unique, value_counts, reset_index
-  sort_values(by,ascending)
-  getdummies 
- groupby --> column name, various functions on grp, iterate
- pivot --> summarize and aggregate data,Grouper
- concat--> give as list, ignore_index,join
- merge--> on,how
- dropna
- fillna
- interpolate
- HW: https://www.kaggle.com/datasets/bytadit/ecommerce-order-datase

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('weather_data_cities.csv',sep=',')

In [30]:
data[data['city'] == "mumbai"]['temperature'].mean()

88.5

In [14]:
data[data['city'].str.upper() == "MUMBAI"]

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [17]:
pd.unique(data['day'])

array(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'], dtype=object)

In [19]:
data['city'].value_counts().reset_index()

       city  count
0  new york      4
1    mumbai      4
2     paris      4

In [22]:
data.sort_values(by='temperature')

         day      city  temperature  windspeed   event
2   1/3/2017  new york           28         12    Snow
0   1/1/2017  new york           32          6    Rain
3   1/4/2017  new york           33          7   Sunny
1   1/2/2017  new york           36          7   Sunny
11  1/4/2017     paris           42         10  Cloudy
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
4   1/1/2017    mumbai           90          5   Sunny
7   1/4/2017    mumbai           92          5    Rain

In [26]:
marks = pd.read_csv('Marks.csv',sep='|')

In [28]:
marks.sort_values(by=2,axis=1)

    P    M   C
0  80  100  92
1  98   88  96
2  84   91  95
3  75   95  80
4  92   80  72

In [33]:
for event in pd.unique(data['event']):
    print(event,data[data['event']==event]['windspeed'].mean())

Rain 5.5
Sunny 9.75
Snow 12.0
Fog 13.5
Cloudy 10.333333333333334

In [38]:
gdf = data.groupby(by='event')
for event,df in gdf:
    print(event)
    print(df)
    print()
type(gdf)

Cloudy
         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

Fog
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   Fog
6  1/3/2017  mumbai           87         15   Fog

Rain
        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain

Snow
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  Snow

Sunny
        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

pandas.core.groupby.generic.DataFrameGroupBy

In [47]:
gdf['windspeed'].max()

event
Cloudy    13
Fog       15
Rain       6
Snow      12
Sunny     20
Name: windspeed, dtype: int64

In [48]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [50]:
dpv = data.pivot_table(index='city',columns='day',values='temperature')

In [51]:
dpv.loc['mumbai','1/3/2017']

87.0

In [55]:
data.pivot_table(index='event',columns='city',values='windspeed',aggfunc='sum')

city    mumbai  new york  paris
event
Cloudy     NaN       NaN   31.0
Fog       27.0       NaN    NaN
Rain       5.0       6.0    NaN
Snow       NaN      12.0    NaN
Sunny      5.0      14.0   20.0

In [58]:
d1 = {
    'A' : [10,20,30,40],
    'B' : [3,4,5,6]
}
d2 = {
    'A' : [30,40,50,60],
    'C' : [3,4,5,6]
}

In [59]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2,index=[0,1,2,5])

In [60]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [61]:
df2

    A  C
0  30  3
1  40  4
2  50  5
5  60  6

In [68]:
df3 = pd.concat([df1,df2])
# df3 = pd.concat([df1,df2],axis = 1)
# df3 = pd.concat([df1,df2],join='inner',ignore_index=True)
# df3 = pd.concat([df1,df2],join='inner',axis = 1)
df3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  NaN
3  40  6.0  NaN
0  30  NaN  3.0
1  40  NaN  4.0
2  50  NaN  5.0
5  60  NaN  6.0

In [71]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [72]:
df2

    A  C
0  30  3
1  40  4
2  50  5
5  60  6

In [76]:
mdf3 = pd.merge(df1,df2,on='A',how='outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [238]:
mdf3 = pd.merge(df1,df2,on='A',how='outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [85]:
df1['A'].apply(float)

0    10.0
1    20.0
2    30.0
3    40.0
Name: A, dtype: float64

In [83]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [90]:
pds = pd.Series(['A','B','A','A','B','C'])

In [91]:
pd.get_dummies(pds)

       A      B      C
0   True  False  False
1  False   True  False
2   True  False  False
3   True  False  False
4  False   True  False
5  False  False   True

In [92]:
mdf3 = pd.merge(df1,df2,on='A',how='outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [93]:
mdf3.dropna()

    A    B    C
2  30  5.0  3.0
3  40  6.0  4.0

In [95]:
mdf3.fillna(10)

    A     B     C
0  10   3.0  10.0
1  20   4.0  10.0
2  30   5.0   3.0
3  40   6.0   4.0
4  50  10.0   5.0
5  60  10.0   6.0

In [99]:
mdf3.interpolate('linear',limit_direction='both')

    A    B    C
0  10  3.0  3.0
1  20  4.0  3.0
2  30  5.0  3.0
3  40  6.0  4.0
4  50  6.0  5.0
5  60  6.0  6.0